Catalogs/НастройкиРасчетаРезервовПоОплатеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>НастройкиРасчетаРезервовПоОплатеТруда</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРезервовПоОплатеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьРезервНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативОтчисленийВРезерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельнаяВеличинаОтчисленийВРезервНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодНачисленияРезерваБУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыНачисленияРезервовПоОплатеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодНачисленияРезерваНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыНачисленияРезервовПоОплатеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиватьНачислениеПредельнойСуммойНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйУчетПоНастройкамБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНастройкиГоловнойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыРасчетовРезерва</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчетаРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРасчетовРезервовПоОплатеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключенияИзРасчетнойБазыФондаОплатыТруда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РезервыПоОплатеТрудаСобытия/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройкиРасчетаРезервовПоОплатеТруда(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущаяГоловнаяОрганизация = Неопределено;
	ЭтоНовый = Ложь;
	Источник.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый);
	Если Не Источник.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый) Тогда
		ЭтоНовый = Ложь;
	КонецЕсли;
	Если Не ЭтоНовый И НЕ Источник.ДополнительныеСвойства.Свойство("ИзмененаГоловнаяОрганизация", ПредыдущаяГоловнаяОрганизация) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, "ГоловнаяОрганизация,ОбособленноеПодразделение");
	
	Если РеквизитыОрганизации.ОбособленноеПодразделение Тогда
		
		// Для обособленного подразделения продублируем существующие настройки резервов по оплате труда.
		// Но только те, которых не оказалось.
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", РеквизитыОрганизации.ГоловнаяОрганизация);
		Запрос.УстановитьПараметр("Организация",         Источник.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиРасчетаРезервовПоОплатеТруда.Ссылка КАК Ссылка,
		|	НастройкиРасчетаРезервовПоОплатеТруда.Резерв КАК Резерв,
		|	НастройкиРасчетаРезервовПоОплатеТруда.ВидРезерва КАК ВидРезерва,
		|	НастройкиРасчетаРезервовПоОплатеТруда.НачалоПериода КАК НачалоПериода,
		|	НастройкиРасчетаРезервовПоОплатеТруда.КонецПериода КАК КонецПериода
		|ПОМЕСТИТЬ ВТ_НастройкиГоловнойОрганизации
		|ИЗ
		|	Справочник.НастройкиРасчетаРезервовПоОплатеТруда КАК НастройкиРасчетаРезервовПоОплатеТруда
		|ГДЕ
		|	НастройкиРасчетаРезервовПоОплатеТруда.Организация = &ГоловнаяОрганизация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НастройкиГоловнойОрганизации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СуществующиеНастройкиФилиала
		|ИЗ
		|	ВТ_НастройкиГоловнойОрганизации КАК ВТ_НастройкиГоловнойОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчетаРезервовПоОплатеТруда КАК НастройкиРасчетаРезервовПоОплатеТруда
		|		ПО ВТ_НастройкиГоловнойОрганизации.Резерв = НастройкиРасчетаРезервовПоОплатеТруда.Резерв
		|			И ВТ_НастройкиГоловнойОрганизации.ВидРезерва = НастройкиРасчетаРезервовПоОплатеТруда.ВидРезерва
		|			И ВТ_НастройкиГоловнойОрганизации.НачалоПериода = НастройкиРасчетаРезервовПоОплатеТруда.НачалоПериода
		|			И ВТ_НастройкиГоловнойОрганизации.КонецПериода = НастройкиРасчетаРезервовПоОплатеТруда.КонецПериода
		|ГДЕ
		|	НастройкиРасчетаРезервовПоОплатеТруда.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НастройкиГоловнойОрганизации.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_НастройкиГоловнойОрганизации КАК ВТ_НастройкиГоловнойОрганизации
		|ГДЕ
		|	НЕ ВТ_НастройкиГоловнойОрганизации.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_СуществующиеНастройкиФилиала.Ссылка
		|				ИЗ
		|					ВТ_СуществующиеНастройкиФилиала)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Справочники.НастройкиРасчетаРезервовПоОплатеТруда.СинхронизироватьНастройки(
				Выборка.Ссылка.ПолучитьОбъект(),
				Источник.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
